window.VICDATA_ANNOUNCEMENTS = [
  {
    "date": "2026-08-10",
    "title": "更新",
    "body": "新增利益集团板块；优化板块结构；修复了全局搜索相关的一些问题。"
  },
  {
    "date": "2026-08-06",
    "title": "更新",
    "body": "新增建筑板块和商品板块。\n修复了一些bug。\n为vc适配了新的配色方案和地图以和原版数据库做出区分。"
  },
  {
    "date": "2026-08-01",
    "title": "更新",
    "body": "新增了英语选项；调整了地域板块的资源表现。"
  },
  {
    "date": "2026-07-30",
    "title": "更新",
    "body": "新增成就板块。"
  },
  {
    "date": "2026-07-28",
    "title": "近期更新",
    "body": "统一了悬浮标签的样式。\n调整了首页卡片布局。"
  }
];
